src/AccumulationRegisters/БонусныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>БонусныеСчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БонусныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоБонусномуСчету</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/РодственныеСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РодственныеСвязи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтепеньРодства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаконныйПредставитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийБонусныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийНакопительныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыДокументаЗаконногоПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ВводНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Сертификаты</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПодотчетниками</xr:Item>
				<xr:Item>AccumulationRegister.БонусныеСчета</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаЛицевыхСчетах</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПерсоналом</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БонусныеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонусныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБонусногоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыБонусныхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Карта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Карты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВзаиморасчетыСКонтрагентами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРеализации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументАванса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДенежныеСредстваНаЛицевыхСчетах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПродажи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ассистент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентПлательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗуба</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Зубы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьБезСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетыСПерсоаналом</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументНачисления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СерийныеНомераСертификатов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерийныеНомераСертификатов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьПартии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоИменнойСертификат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СертификатМногоразовоеИспользование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоминала</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетыСПодотчетниками</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/БонусныеСчета/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ПОЛУЧЕНИЕ_ДАННЫХ_С_БОНУСНОГО_СЧЕТА

// Функция вернет остаток на БС клиента.
 //
Функция ПолучитьОстатокНаБонусномСчетеВладельца(БонусныйСчет, Период = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(БонусныйСчет) Тогда 
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(БонусныеСчетаОстатки.СуммаОстаток), 0) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.БонусныеСчета.Остатки(&Период, БонусныйСчет = &БонусныйСчет) КАК БонусныеСчетаОстатки");						  
	
	Запрос.УстановитьПараметр("Период"	     , ?(Период = Неопределено, ТекущаяДатаСеанса(), Период));
	Запрос.УстановитьПараметр("БонусныйСчет" , БонусныйСчет);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат ?(Результат.Количество() > 0, Результат[0].СуммаОстаток, 0);
			
КонецФункции

// Функция, возвращает таблицу бонусных счетов с остатками.
//
Функция ПолучитьОстаткиНаБонусныхСчетахКонтрагента(Клиент, ТаблицаИсключенныхБонусныхСчетов = Неопределено) Экспорт
	
	Если ТаблицаИсключенныхБонусныхСчетов = Неопределено Тогда
		ТаблицаИсключенныхБонусныхСчетов = Новый ТаблицаЗначений;
		ТаблицаИсключенныхБонусныхСчетов.Колонки.Добавить("БонусныйСчет" 			, Новый ОписаниеТипов("СправочникСсылка.БонусныеСчета"));
		ТаблицаИсключенныхБонусныхСчетов.Колонки.Добавить("Сумма"					, Новый ОписаниеТипов("Число"	, Новый КвалификаторыЧисла(15,3)));
		ТаблицаИсключенныхБонусныхСчетов.Колонки.Добавить("Наименование" 			, Новый ОписаниеТипов("Строка"	, Новый КвалификаторыСтроки(150)));
		ТаблицаИсключенныхБонусныхСчетов.Колонки.Добавить("ВидБонусногоСчета" 		, Новый ОписаниеТипов("СправочникСсылка.ВидыБонусныхСчетов"));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
		МассивТипов.Добавить(Тип("СправочникСсылка.Карты"));   
		ТаблицаИсключенныхБонусныхСчетов.Колонки.Добавить("ВладелецБонусногоСчета"	, Новый ОписаниеТипов(МассивТипов));
		
		//ТаблицаИсключенныхБонусныхСчетов.Добавить();
	КонецЕсли;
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаИсключенныхБонусныхСчетов.БонусныйСчет КАК БонусныйСчет,
	|	ТаблицаИсключенныхБонусныхСчетов.Сумма КАК Сумма,
	|	ТаблицаИсключенныхБонусныхСчетов.ВидБонусногоСчета КАК ВидБонусногоСчета,
	|	ТаблицаИсключенныхБонусныхСчетов.ВладелецБонусногоСчета КАК ВладелецБонусногоСчета,
	|	ТаблицаИсключенныхБонусныхСчетов.Наименование КАК Наименование
	|ПОМЕСТИТЬ ТаблицаИсключенныхБонусныхСчетов
	|ИЗ
	|	&ТаблицаИсключенныхБонусныхСчетов КАК ТаблицаИсключенныхБонусныхСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпрБонусныеСчета.ВидБонусногоСчета.Наименование КАК Наименование,
	|	СпрБонусныеСчета.Ссылка КАК БонусныйСчет,
	|	СпрБонусныеСчета.ВидБонусногоСчета КАК ВидБонусногоСчета
	|ПОМЕСТИТЬ БонусныеСчетаКонтрагента
	|ИЗ
	|	Справочник.БонусныеСчета КАК СпрБонусныеСчета
	|ГДЕ
	|	НЕ СпрБонусныеСчета.ПометкаУдаления
	|	И НЕ СпрБонусныеСчета.Закрыт
	|	И (СпрБонусныеСчета.ВладелецБонусногоСчета = &Клиент
	|			ИЛИ СпрБонусныеСчета.ВладелецБонусногоСчета В
	|				(ВЫБРАТЬ
	|					РодственныеСвязи.Родственник КАК Родственник
	|				ИЗ
	|					РегистрСведений.РодственныеСвязи КАК РодственныеСвязи
	|				ГДЕ
	|					РодственныеСвязи.Контрагент = &Клиент
	|					И РодственныеСвязи.ОбщийБонусныйСчет))
	|	И ВЫБОР
	|			КОГДА СпрБонусныеСчета.СрокДействияНачало <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СпрБонусныеСчета.СрокДействияКонец <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА СпрБонусныеСчета.СрокДействияНачало <= &ТекущаяДата
	|						И СпрБонусныеСчета.СрокДействияКонец >= &ТекущаяДата
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.БонусныйСчет КАК БонусныйСчет,
	|	ВложенныйЗапрос.Наименование КАК Наименование,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	ВложенныйЗапрос.ВидБонусногоСчета КАК ВидБонусногоСчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		БонусныеСчетаКонтрагента.Наименование КАК Наименование,
	|		БонусныеСчетаКонтрагента.БонусныйСчет КАК БонусныйСчет,
	|		БонусныеСчетаКонтрагента.БонусныйСчет.ВладелецБонусногоСчета КАК Контрагент,
	|		ЕСТЬNULL(БонусныеСчетаОстатки.СуммаОстаток, 0) КАК Сумма,
	|		БонусныеСчетаКонтрагента.ВидБонусногоСчета КАК ВидБонусногоСчета
	|	ИЗ
	|		БонусныеСчетаКонтрагента КАК БонусныеСчетаКонтрагента
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БонусныеСчета.Остатки(
	|					,
	|					БонусныйСчет В
	|						(ВЫБРАТЬ
	|							БонусныеСчетаКонтрагента.БонусныйСчет
	|						ИЗ
	|							БонусныеСчетаКонтрагента)) КАК БонусныеСчетаОстатки
	|			ПО БонусныеСчетаКонтрагента.БонусныйСчет = БонусныеСчетаОстатки.БонусныйСчет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИсключенныхБонусныхСчетов.Наименование,
	|		ТаблицаИсключенныхБонусныхСчетов.БонусныйСчет,
	|		ТаблицаИсключенныхБонусныхСчетов.ВладелецБонусногоСчета,
	|		-1 * ТаблицаИсключенныхБонусныхСчетов.Сумма,
	|		ТаблицаИсключенныхБонусныхСчетов.ВидБонусногоСчета
	|	ИЗ
	|		ТаблицаИсключенныхБонусныхСчетов КАК ТаблицаИсключенныхБонусныхСчетов) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.БонусныйСчет,
	|	ВложенныйЗапрос.ВидБонусногоСчета,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.Наименование");
	
	Запрос.УстановитьПараметр("Клиент"	   						, Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата"						, ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТаблицаИсключенныхБонусныхСчетов", ТаблицаИсключенныхБонусныхСчетов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, возвращает сумму начисленных бонусов по реализации.
//
Функция ПолучитьНачисленнуюСуммуБонусногоСчетаПоРеализации(МассивРеализаций, БонусныйСчет) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(БонусныеСчетаОбороты.СуммаПриход), 0) КАК СуммаПриход
	|ИЗ
	|	РегистрНакопления.БонусныеСчета.Обороты(, , Регистратор, БонусныйСчет = &БонусныйСчет) КАК БонусныеСчетаОбороты
	|ГДЕ
	|	БонусныеСчетаОбороты.Регистратор В(&МассивРегистраторов)");
	
	Запрос.УстановитьПараметр("МассивРегистраторов"	, МассивРеализаций);
	Запрос.УстановитьПараметр("БонусныйСчет"		, БонусныйСчет);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат ?(Результат.Количество() = 0, 0, Результат[0].СуммаПриход);
	
КонецФункции

// Функция вернет остатко на БС клиента
//
Функция ПолучитьОстатокНаБонусномСчетеКлиента(БонусныйСчет, Период = Неопределено, ВладелецБС = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(БонусныйСчет) И Не ЗначениеЗаполнено(ВладелецБС) Тогда 
		Возврат 0;
	КонецЕсли;
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БонусныеСчетаОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.БонусныеСчета.Остатки(
	|			&Период,
	|			&Фильтр
	|				И ВЫБОР
	|					КОГДА БонусныйСчет.СрокДействияНачало <> ДАТАВРЕМЯ(1, 1, 1)
	|							И БонусныйСчет.СрокДействияКонец <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА БонусныйСчет.СрокДействияНачало <= &Дата
	|								И БонусныйСчет.СрокДействияКонец >= &Дата
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И НЕ БонусныйСчет.ПометкаУдаления) КАК БонусныеСчетаОстатки";              
	
	Запрос.УстановитьПараметр("Период"       , ?(Период = Неопределено, Новый Граница(ТекущаяДатаСеанса(), ВидГраницы.Включая), Новый Граница(Период, ВидГраницы.Включая)));
	Запрос.установитьпараметр("Дата"	     , ?(Период = Неопределено, ТекущаяДатаСеанса(), Период));
	Запрос.УстановитьПараметр("БонусныйСчет" , БонусныйСчет);
	
	Если ЗначениеЗаполнено(БонусныйСчет) Тогда  
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Фильтр", "БонусныйСчет = &БонусныйСчет");    
	Иначе
		
		МассивКонтрагентовБС = Новый Массив;
		МассивКонтрагентовБС.Добавить(ВладелецБС);
		
		ТаблицаРодственников = РегистрыСведений.РодственныеСвязи.РодственникиКлиента(ВладелецБС,,,, Истина);
		
		Для Каждого СтрокаТЗ Из ТаблицаРодственников Цикл			
			МассивКонтрагентовБС.Добавить(СтрокаТЗ.Родственник);				
		КонецЦикла;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Фильтр", "БонусныйСчет.ВладелецБонусногоСчета В (&ВладельцыБС)");
		Запрос.УстановитьПараметр("ВладельцыБС", МассивКонтрагентовБС);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() > 0 Тогда
		Возврат Выборка.Итог("СуммаОстаток");
	Иначе 
		Возврат 0;
	КонецЕсли;  
	
КонецФункции

#КонецОбласти

#Область СПИСАНИЕ_ПО_ПАРТИЯМ

// Процедура формирует таблицу движенимй бонусных счетов по "партиям".
//
Процедура СформироватьТаблицуБонусныеСчета(СтруктураДополнительныеСвойства) Экспорт
	
	ЭтоВозврат = ТипЗнч(СтруктураДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.ВозвратОтПокупателя");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаБонусныеСчета.Период КАК Период,
	|	ТаблицаБонусныеСчета.ВидДвижения КАК ВидДвижения,
	|	ТаблицаБонусныеСчета.БонусныйСчет КАК БонусныйСчет,
	|	ТаблицаБонусныеСчета.ДокументНачисления КАК ДокументНачисления,
	|	СУММА(ТаблицаБонусныеСчета.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаНачислениеБонусов КАК ТаблицаБонусныеСчета
	|ГДЕ
	|	ТаблицаБонусныеСчета.Сумма > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаБонусныеСчета.Период,
	|	ТаблицаБонусныеСчета.ВидДвижения,
	|	ТаблицаБонусныеСчета.БонусныйСчет,
	|	ТаблицаБонусныеСчета.ДокументНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Документ.ВводНачальныхОстатков.ПустаяСсылка),
	|	0
	|ГДЕ
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Документ.ОперацияПоБонусномуСчету.ПустаяСсылка),
	|	0
	|ГДЕ
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка),
	|	0
	|ГДЕ
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Документ.ПоступлениеДенежныхСредств.ПустаяСсылка),
	|	0
	|ГДЕ
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Документ.Реализация.ПустаяСсылка),
	|	0
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаСписаниеБонусов.Период КАК Период,
	|	ВременнаяТаблицаСписаниеБонусов.ВидДвижения КАК ВидДвижения,
	|	ВременнаяТаблицаСписаниеБонусов.БонусныйСчет КАК БонусныйСчет,
	|	СУММА(ВременнаяТаблицаСписаниеБонусов.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаСписаниеБонусов КАК ВременнаяТаблицаСписаниеБонусов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаСписаниеБонусов.Период,
	|	ВременнаяТаблицаСписаниеБонусов.ВидДвижения,
	|	ВременнаяТаблицаСписаниеБонусов.БонусныйСчет";
	
	Если Не ЭтоВозврат Тогда
		Запрос.Текст = Запрос.Текст + " 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БонусныеСчетаОстатки.БонусныйСчет КАК БонусныйСчет,
		|	БонусныеСчетаОстатки.ДокументНачисления КАК ДокументНачисления,
		|	БонусныеСчетаОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.БонусныеСчета.Остатки(
		|			&ПериодОстатков,
		|			БонусныйСчет В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаСписаниеБонусов.БонусныйСчет
		|				ИЗ
		|					ВременнаяТаблицаСписаниеБонусов)) КАК БонусныеСчетаОстатки
		|ГДЕ
		|	БонусныеСчетаОстатки.СуммаОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	БонусныеСчетаОстатки.ДокументНачисления.Дата";   		
	Иначе 
		Запрос.Текст = Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БонусныеСчетаОстатки.БонусныйСчет КАК БонусныйСчет,
		|	БонусныеСчетаОстатки.ДокументНачисления КАК ДокументНачисления,
		|	БонусныеСчетаОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	ТаблицаДвиженийБонусныеСчетаДокументОснованиеСУчетомВозвратов КАК БонусныеСчетаОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	БонусныеСчетаОстатки.ДокументНачисления.Дата";
	КонецЕсли;
	
	Если СтруктураДополнительныеСвойства.Свойство("ДатаРасчетаОстатковНаБонусныхСчетах") 
		И ЗначениеЗаполнено(СтруктураДополнительныеСвойства.ДатаРасчетаОстатковНаБонусныхСчетах) Тогда 
		Запрос.УстановитьПараметр("ПериодОстатков", СтруктураДополнительныеСвойства.ДатаРасчетаОстатковНаБонусныхСчетах);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПериодОстатков", "");
	КонецЕсли;         
	
	РезультатЗапроса     = Запрос.ВыполнитьПакет();
	ТаблицаБонусныеСчета = РезультатЗапроса[0].Выгрузить();
	
	ТаблицаОплатаБонуснымиСчетами = РезультатЗапроса[1].Выгрузить();
	ОстатокНаБонусныхСчетах       = РезультатЗапроса[2].Выгрузить();
	
	Для Каждого СтрокаТЗОплата Из ТаблицаОплатаБонуснымиСчетами Цикл
		
		ОстатокНаБонусномСчете = ОстатокНаБонусныхСчетах.НайтиСтроки(Новый Структура("БонусныйСчет", СтрокаТЗОплата.БонусныйСчет));
		Для Каждого СтрокаТЗОстаток Из ОстатокНаБонусномСчете Цикл
			
			СуммаОплатаБонусамиПоПартии     = ?(СтрокаТЗОстаток.СуммаОстаток > СтрокаТЗОплата.Сумма, СтрокаТЗОплата.Сумма, СтрокаТЗОстаток.СуммаОстаток);
			НоваяСтрока                     = ТаблицаБонусныеСчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗОплата);
			
			НоваяСтрока.ДокументНачисления = СтрокаТЗОстаток.ДокументНачисления;
			НоваяСтрока.Сумма              = СуммаОплатаБонусамиПоПартии;
			СтрокаТЗОплата.Сумма           = СтрокаТЗОплата.Сумма - СуммаОплатаБонусамиПоПартии;
			СтрокаТЗОстаток.СуммаОстаток   = СтрокаТЗОстаток.СуммаОстаток - СуммаОплатаБонусамиПоПартии;			
			
			Если СтрокаТЗОплата.Сумма = 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// если что-то есть не списанное по партиям, списать без документа основания.
	Если ТаблицаОплатаБонуснымиСчетами.Итог("Сумма") > 0 Тогда
		Для Каждого СтрокаТЗОплата Из ТаблицаОплатаБонуснымиСчетами Цикл
			Если СтрокаТЗОплата.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ТаблицаБонусныеСчета.Добавить(), СтрокаТЗОплата);
		КонецЦикла;
	КонецЕсли;   	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБонусныеСчета", ТаблицаБонусныеСчета);	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
